#!/bin/bash

echo -n 'Количество процессов запущенных из под текущего пользователя: '
ps -e | wc -l

echo '============================================================='

echo -n 'Load Average за 15 минут: '
uptime | awk '{ print $10 }'

echo '============================================================='

echo 'Количество свободной памяти:'
free -h

echo '============================================================='

echo 'Свободное место в рутовом разделе: '
df -h / | awk '{ print $3,$4,$5,$6 }' | column -t
